server/app/controllers/abouts_controller.rb

UPDATE "users" SET "name" = $1, "bio" = $2, "phone" = $3, "username" = $4, "updated_at" = $5 WHERE "users"."id" = $6
---
  def create
      current_user.name=params[:name]
      current_user.bio=params[:bio]
      current_user.email=params[:email]
      current_user.phone=params[:phone]
      current_user.username=params[:username]
      current_user.save