server/app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "project_link", "img_link", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        current_user.project.create(title: params[:title], description: params[:description], project_link: params[:project_link], img_link: params[:img_link])

SELECT  "projects".* FROM "projects" WHERE "projects"."user_id" = $1 AND "projects"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 20], ["LIMIT", 1]]
UPDATE "projects" SET "title" = $1, "description" = $2, "project_link" = $3, "updated_at" = $4 WHERE "projects"."id" = $5  [["title", "yyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyyy"], ["description", "yyyyyyyyyyyyyyyyyy"], ["project_link", "argtyderdef"], ["updated_at", "2019-02-27 11:33:42.312203"], ["id", 21]]
---
    def edit

        proj=current_user.project.find(params[:id])
        proj.title=params[:title]
        proj.description=params[:description]
        proj.project_link=params[:project_link]
        proj.img_link=params[:img_link]
        proj.save

DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 21]]
---
    def destroy
        current_user.project.destroy(params[:id])