server/app/controllers/publics_controller.rb

    def index
      render :json => {
        "about"=>user.find(params[:id]),
        "project_data"=>user.find(params[:id]).project
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = $1 ORDER BY "projects"."created_at" DESC  [["user_id", 2]]